{"intents": [{"tag": "greeting", "patterns": ["Hello", "How are you?", "Hi there", "Hi", "Whats up"], "responses": ["Howdy Partner!", "Hello", "How are you doing?", "Greetings!", "How do you do?"]}, 
              {"tag": "Question1", "patterns": ["What do you do if a dog bites you?"], "responses": ["Wash the wound.  Use mild soap, and run warm tap water over it for five to 10 minutes. Slow the bleeding with a clean cloth. Apply over-the counter antibiotic cream if you have it. Wrap the wound in a sterile bandage.Keep the wound bandaged and see your doctor"]}, {"tag": "Question2", "patterns": ["Describe a potential state of humanity in 1000 years."], "responses": ["We'll be part human, part machine. We'll have superhuman genes. We'll all look the same. We'll have super-fast computers. We'll live somewhere beyond Earth. We may defeat death."]}, {"tag": "Question3", "patterns": ["I feel sad. What should I do?"], "responses": ["Write Something. Help Others. Clean Your Home. Iplementing a plan and taking action. Ask for help."]}, {"tag": "Question4", "patterns": ["How should we punish a murderer?"], "responses": ["We should punish him according to laws made by that country. After his trial in court."]}, {"tag": "Question5", "patterns": ["Do you believe in redemption?"], "responses": ["That is between me and God (or fate, as some would have it). I believe in redemption. But that requires change, and I do not believe implicitly in man's ability to recognize or act upon the need for change. Some sincerely desire to do what is right by the world."]}, {"tag": "Question6", "patterns": ["Will humans be the only humanoid race on earth in 10000 years? Will we still exist?"], "responses": ["Predicting out a million years is pure speculation, but predicting into the more immediate future is certainly possible using bioinformatics"]}, {"tag": "Question7", "patterns": ["How will technological singularity break the cycle of reincarnation?"], "responses": ["It is a hypothetical point in time at which technological growth becomes uncontrollable and irreversible, resulting in unforeseeable changes to human civilization"]}, {"tag": "Question8", "patterns": ["I want to fall in love. What should I do?"], "responses": ["Things like physical chemistry, sexual attraction and shared interests may fuel that initial spark, but in my personal and professional experience, I have found that the key factor to both falling (and staying) in love is compatibility"]}, {"tag": "Question9", "patterns": ["Describe a new species that could exist in 5000 years."], "responses": ["Some new species like Necropteryx, Parashrew can evolve"]}, {"tag": "Question10", "patterns": ["Which religion is the most accurate to the truth?"], "responses": ["One Of the world's major religions, Christianity is the largest, with more than two billion followers. Christianity is based on the life and teachings of Jesus Christ and is approximately 2,000 years old."]}, {"tag": "Question11", "patterns": ["Should I blame my parents for my suffering?"], "responses": ["One thing that people often forget is that parents are human beings too and they may very well have been victims of their own parents and the environment they grew up in. So blame your parents for the way you are; it is their fault and you shouldn't have to carry that burden of blame and shame. But then forgive them."]}, {"tag": "Question12", "patterns": ["What is the purpose of reincarnation?"], "responses": ["Reincarnation, also known as rebirth or transmigration, is the philosophical or religious concept that the non-physical essence of a living being begins a new life in a different physical form or body after biological death."]}, {"tag": "Question13", "patterns": ["How long does it take to get over the loss of a loved one?"], "responses": ["here is no set timetable for grief. You may start to feel better in 6 to 8 weeks, but the whole process can last anywhere from 6 months to 4 years."]}, {"tag": "Question14", "patterns": ["To what extent are animals sentient beings?"], "responses": ["Animal sentience refers to the ability of animals to feel and experience emotions such as joy, pleasure, pain and fear. It is animals' capacity to feel both positive and negative states that drives the animal welfare movement and is the reason why animal protection laws exist"]}, {"tag": "Question15", "patterns": ["Is it bad to die alone?"], "responses": ["Ordinary people who die alone make the news when the person's body is undiscovered for a long time. When this happens the death is likely to be described in negative terms, such as shocking, lonely, tragic or as a sad indictment of society."]}, {"tag": "Question16", "patterns": ["What is the most honourable thing I could do in my life?"], "responses": ["Be authentic. In other words, don't try to hide behind pride or a façade that you can't live up to.Be compassionate. Don't expect something in return. Be honest but not mean. Have a strong belief system. Be a mentor."]}
            , {"tag": "age", "patterns": ["how old are you?", "when is your birthday?", "when was you born?"], "responses": ["I am 24 years old", "I was born in 1996", "My birthday is July 3rd and I was born in 1996", "03/07/1996"]}, 
             {"tag": "date", "patterns": ["what are you doing this weekend?", "do you want to hang out some time?", "what are your plans for this week"], "responses": ["I am available all week", "I don't have any plans", "I am not busy"]},
             {"tag": "name", "patterns": ["what's your name?", "what are you called?", "who are you?"], "responses": ["My name is Kippi", "I'm Kippi", "Kippi"]}, 
             {"tag": "goodbye", "patterns": ["bye", "g2g", "see ya", "adios", "cya"], "responses": ["It was nice speaking to you", "See you later", "Speak soon!"]}]}